<script setup lang="ts">
const { locale } = useI18n();
const router = useRouter();
const slug = ref(router.currentRoute.value.params.slug);
const path = `/${locale.value}/legal/${slug.value}` as string;
console.log(path);
</script>

<template>
  <main class="container mx-auto p-4">
    <ContentDoc :path="path">
      <template #default="{ doc }">
        <article class="container p-4">
          <h2 class="text-primary text-2xl uppercase p-4 font-bold text-center">{{ doc.title }}</h2>
          <p class="text-primary uppercase p-2 font-semibold text-center">{{ doc.description }}</p>
          <ContentRenderer :value="doc" class="text-justify" />
        </article>
      </template>
      <template #not-found>
        <div class="flex items-center justify-center h-screen">
          <div class="text-center p-4 animation-fade-in-up">
            <div class="pb-6">
              <svg class="w-24 h-24 mx-auto fill-green-50" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 297.001 297.001">
                <g>
                  <path class="animate-pulse fill-yellow-400" d="M214.198,184.475c-1.746-4.074-6.461-5.96-10.535-4.224c-4.073,1.756-5.97,6.472-4.214,10.545
                    c1.294,3.041,4.264,4.866,7.375,4.866c1.053,0,2.127-0.211,3.16-0.652C214.058,193.265,215.944,188.548,214.198,184.475z"/>
                  <path class="animate-pulse fill-yellow-300" d="M225.867,211.687c-1.756-4.074-6.471-5.961-10.545-4.214c-4.073,1.746-5.96,6.461-4.214,10.535
                    c1.304,3.05,4.264,4.877,7.385,4.877c1.053,0,2.117-0.212,3.15-0.653C225.717,220.486,227.613,215.76,225.867,211.687z"/>
                  <path class="animate-pulse fill-yellow-200" d="M237.526,238.908c-1.746-4.074-6.461-5.97-10.545-4.224c-4.073,1.756-5.961,6.472-4.214,10.545
                    c1.304,3.041,4.274,4.866,7.385,4.866c1.053,0,2.127-0.211,3.16-0.652C237.386,247.698,239.272,242.982,237.526,238.908z"/>
                  <path class="animate-pulse fill-yellow-100" d="M241.811,261.264c-2.108,0-4.174,0.852-5.669,2.348c-1.495,1.494-2.358,3.562-2.358,5.679
                    c0,2.107,0.862,4.173,2.358,5.668c1.496,1.495,3.562,2.348,5.669,2.348c2.117,0,4.184-0.852,5.679-2.348
                    c1.494-1.495,2.348-3.562,2.348-5.668c0-2.117-0.853-4.185-2.348-5.679C245.995,262.116,243.928,261.264,241.811,261.264z"/>
                  <path class="animate-pulse fill-yellow-400" d="M93.341,180.251c-4.073-1.736-8.789,0.15-10.535,4.224c-1.756,4.073,0.141,8.789,4.214,10.535
                    c1.034,0.441,2.097,0.652,3.151,0.652c3.12,0,6.08-1.825,7.384-4.866C99.301,186.723,97.415,182.007,93.341,180.251z"/>
                  <path class="animate-pulse fill-yellow-300" d="M81.671,207.473c-4.073-1.746-8.789,0.14-10.535,4.214c-1.745,4.073,0.141,8.799,4.214,10.545
                    c1.034,0.441,2.107,0.653,3.161,0.653c3.11,0,6.08-1.826,7.384-4.877C87.642,213.934,85.756,209.219,81.671,207.473z"/>
                  <path class="animate-pulse fill-yellow-200" d="M70.012,234.684c-4.073-1.746-8.799,0.15-10.545,4.224c-1.746,4.073,0.141,8.789,4.224,10.535
                    c1.024,0.441,2.097,0.652,3.151,0.652c3.12,0,6.08-1.825,7.384-4.866C75.973,241.156,74.086,236.44,70.012,234.684z"/>
                  <path class="animate-pulse fill-yellow-100" d="M55.183,261.264c-2.108,0-4.174,0.852-5.669,2.348c-1.495,1.494-2.358,3.562-2.358,5.679
                    c0,2.107,0.862,4.173,2.358,5.668c1.495,1.495,3.562,2.348,5.669,2.348c2.117,0,4.184-0.852,5.679-2.348
                    c1.494-1.495,2.348-3.562,2.348-5.668c0-2.117-0.853-4.185-2.348-5.679C59.367,262.116,57.299,261.264,55.183,261.264z"/>
                  <circle class="animate-pulse fill-yellow-400" cx="148.497" cy="188.007" r="8.027"/>
                  <circle class="animate-pulse fill-yellow-300" cx="148.497" cy="215.098" r="8.027"/>
                  <circle class="animate-pulse fill-yellow-200" cx="148.497" cy="242.189" r="8.027"/>
                  <circle class="animate-pulse fill-yellow-100" cx="148.497" cy="269.28" r="8.027"/>
                  <path class="fill-green-400" d="M294.534,140.658h-63.607c-1.917,0-3.101,2.091-2.115,3.735l9.349,15.581c0.446,0.743,1.249,1.197,2.115,1.197h38.678
                    c9.967,0,18.047-8.08,18.047-18.047C297,141.762,295.896,140.658,294.534,140.658z"/>
                  <path class="fill-green-300" d="M197.707,92.552l19.717,32.861c0.446,0.743,1.249,1.197,2.115,1.197h50.223c2.501,0,3.414-3.294,1.269-4.581
                    l-54.769-32.861c-0.383-0.23-0.822-0.351-1.269-0.351h-15.171C197.904,88.817,196.72,90.908,197.707,92.552z"/>
                  <path class="fill-green-200 animate-pulse" d="M89.631,74.77H207.37c1.518,0,2.683-1.361,2.442-2.861c-4.748-29.561-30.433-52.215-61.312-52.215
                    c-30.879,0-56.564,22.655-61.312,52.215C86.948,73.409,88.112,74.77,89.631,74.77z"/>
                  <path class="fill-green-400" d="M27.239,126.61h50.223c0.866,0,1.669-0.455,2.115-1.197l19.717-32.861c0.986-1.644-0.198-3.735-2.115-3.735H82.008
                    c-0.447,0-0.886,0.122-1.269,0.351L25.97,122.029C23.825,123.316,24.737,126.61,27.239,126.61z"/>
                  <path class="fill-green-400" d="M58.84,159.974l9.349-15.581c0.986-1.644-0.198-3.735-2.115-3.735H2.466c-1.362,0-2.466,1.104-2.466,2.466v0.001
                    c0,9.967,8.079,18.046,18.046,18.046h38.679C57.591,161.171,58.394,160.717,58.84,159.974z"/>
                  <path class="fill-green-400" d="M220.256,157.436l-9.349-15.581c-0.446-0.743-1.248-1.197-2.115-1.197H157.99c-1.362,0-2.466,1.104-2.466,2.466v15.581
                    c0,1.362,1.104,2.466,2.466,2.466h60.152C220.059,161.171,221.243,159.08,220.256,157.436z"/>
                  <path class="fill-green-400" d="M119.312,88.817c-0.866,0-1.669,0.455-2.115,1.197L97.48,122.875c-0.986,1.644,0.198,3.735,2.115,3.735h39.415
                    c1.362,0,2.466-1.104,2.466-2.466V91.283c0-1.362-1.104-2.466-2.466-2.466H119.312z"/>
                  <path class="fill-green-500" d="M141.476,158.705v-15.581c0-1.362-1.104-2.466-2.466-2.466H88.207c-0.866,0-1.669,0.455-2.115,1.197l-9.349,15.581
                    c-0.986,1.644,0.198,3.735,2.115,3.735h60.152C140.372,161.171,141.476,160.067,141.476,158.705z"/>
                  <path class="fill-green-500" d="M177.688,88.817H157.99c-1.362,0-2.466,1.104-2.466,2.466v32.861c0,1.362,1.104,2.466,2.466,2.466h39.415
                    c1.917,0,3.101-2.091,2.115-3.735l-19.717-32.861C179.357,89.272,178.554,88.817,177.688,88.817z"/>
                </g>
              </svg>
            </div>
            <h1 class="text-xl font-bold">Oops! Parece um deserto por aqui...</h1>
            <p class="mt-4">Infelizmente, não conseguimos encontrar este documento. Talvez ele tenha sido abduzido por aliens!</p>
            <div class="mt-6">
              <RouterLink to="/legal" class="btn btn-primary">
                Voltar para a Civilização
                <svg xmlns="http://www.w3.org/2000/svg" fill="currentColor" class="w-8 h-8 animate-bounce text-secondary" viewBox="0 0 16 16">
                  <path d="M8 3a1.5 1.5 0 1 0 0-3 1.5 1.5 0 0 0 0 3"/>
                  <path d="m5.93 6.704-.846 8.451a.768.768 0 0 0 1.523.203l.81-4.865a.59.59 0 0 1 1.165 0l.81 4.865a.768.768 0 0 0 1.523-.203l-.845-8.451A1.5 1.5 0 0 1 10.5 5.5L13 2.284a.796.796 0 0 0-1.239-.998L9.634 3.84a.7.7 0 0 1-.33.235c-.23.074-.665.176-1.304.176-.64 0-1.074-.102-1.305-.176a.7.7 0 0 1-.329-.235L4.239 1.286a.796.796 0 0 0-1.24.998l2.5 3.216c.317.316.475.758.43 1.204Z"/>
                </svg>
              </RouterLink>
            </div>
          </div>
        </div>
      </template>
      <template #empty>
        <div class="flex items-center justify-center h-screen">
          <div class="text-center p-4 animation-fade-in-up">
            <div class="animate-pulse pb-4">
              <svg xmlns="http://www.w3.org/2000/svg" fill="currentColor" class="w-24 h-24 mx-auto text-warning" viewBox="0 0 16 16">
                <path d="M.54 3.87.5 3a2 2 0 0 1 2-2h3.672a2 2 0 0 1 1.414.586l.828.828A2 2 0 0 0 9.828 3h3.982a2 2 0 0 1 1.992 2.181L15.546 8H14.54l.265-2.91A1 1 0 0 0 13.81 4H2.19a1 1 0 0 0-.996 1.09l.637 7a1 1 0 0 0 .995.91H9v1H2.826a2 2 0 0 1-1.991-1.819l-.637-7a2 2 0 0 1 .342-1.31zm6.339-1.577A1 1 0 0 0 6.172 2H2.5a1 1 0 0 0-1 .981l.006.139q.323-.119.684-.12h5.396z"/>
                <path d="M11.854 10.146a.5.5 0 0 0-.707.708L12.293 12l-1.146 1.146a.5.5 0 0 0 .707.708L13 12.707l1.146 1.147a.5.5 0 0 0 .708-.708L13.707 12l1.147-1.146a.5.5 0 0 0-.707-.708L13 11.293z"/>
              </svg>
            </div>
            <h1 class="text-xl font-bold">Oops! Parece que este documento está vazio...</h1>
            <p class="mt-4">Infelizmente, não conseguimos encontrar nenhum conteúdo neste documento!</p>
            <div class="mt-6">
              <RouterLink to="/legal" class="btn btn-primary">
                Voltar para listagem
              </RouterLink>
            </div>
          </div>
        </div>
      </template>
    </ContentDoc>
  </main>
</template>

<style scoped>

</style>